src/test/testtool/RaadpleegMetBurgerservicenummer/03/request.xml

<soapenv:Envelope xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink">
<soapenv:Header/>
<soapenv:Body>
<BG:npsLv01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<BG:stuurgegevens>
<StUF:berichtcode>Lv01</StUF:berichtcode>
<StUF:zender>
<StUF:organisatie>0518</StUF:organisatie>
<StUF:applicatie>DEC_ZKN</StUF:applicatie>
<StUF:gebruiker>Test1</StUF:gebruiker>
</StUF:zender>
<StUF:ontvanger>
<StUF:organisatie>test</StUF:organisatie>
<StUF:applicatie>test_A</StUF:applicatie>
</StUF:ontvanger>
<StUF:referentienummer>2d8e1294-7238-428f-ae2b-69ed723aa64f</StUF:referentienummer>
<StUF:tijdstipBericht>20241014152137643</StUF:tijdstipBericht>
<StUF:entiteittype>NPS</StUF:entiteittype>
</BG:stuurgegevens>
<BG:parameters>
<StUF:sortering>1</StUF:sortering>
<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
<StUF:maximumAantal>50</StUF:maximumAantal>
<StUF:indicatorAantal>true</StUF:indicatorAantal>
</BG:parameters>
<BG:gelijk StUF:entiteittype="NPS">
<BG:inp.bsn>999991243</BG:inp.bsn>
</BG:gelijk>
<BG:scope>
<BG:object StUF:entiteittype="NPS" StUF:sleutelGegevensbeheer="" StUF:sleutelVerzendend="">
<BG:inp.bsn xsi:nil="true"/>
<BG:sub.typering xsi:nil="true"/>
<BG:inp.a-nummer xsi:nil="true"/>
<BG:geslachtsnaam xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaam xsi:nil="true"/>
<BG:voorletters xsi:nil="true"/>
<BG:voornamen xsi:nil="true"/>
<BG:aanduidingNaamgebruik xsi:nil="true"/>
<BG:geslachtsnaamPartner xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true"/>
<BG:aanhefAanschrijving xsi:nil="true"/>
<BG:voornamenAanschrijving xsi:nil="true"/>
<BG:geslachtsnaamAanschrijving xsi:nil="true"/>
<BG:adellijkeTitelPredikaat xsi:nil="true"/>
<BG:geslachtsaanduiding xsi:nil="true"/>
<BG:geboortedatum xsi:nil="true"/>
<BG:inp.geboorteplaats xsi:nil="true"/>
<BG:inp.geboorteLand xsi:nil="true"/>
<BG:overlijdensdatum xsi:nil="true"/>
<BG:verblijfsadres>
<BG:aoa.identificatie xsi:nil="true"/>
<BG:wpl.identificatie xsi:nil="true"/>
<BG:wpl.woonplaatsNaam xsi:nil="true"/>
<BG:aoa.woonplaatsWaarinGelegen>
<BG:wpl.identificatie xsi:nil="true"/>
<BG:wpl.woonplaatsNaam xsi:nil="true"/>
</BG:aoa.woonplaatsWaarinGelegen>
<BG:gor.identificatie xsi:nil="true"/>
<BG:opr.identificatie xsi:nil="true"/>
<BG:gor.openbareRuimteNaam xsi:nil="true"/>
<BG:gor.straatnaam xsi:nil="true"/>
<BG:aoa.postcode xsi:nil="true"/>
<BG:aoa.huisnummer xsi:nil="true"/>
<BG:aoa.huisletter xsi:nil="true"/>
<BG:aoa.huisnummertoevoeging xsi:nil="true"/>
<BG:inp.locatiebeschrijving xsi:nil="true"/>
<BG:begindatumVerblijf xsi:nil="true"/>
</BG:verblijfsadres>
<BG:sub.verblijfBuitenland>
<BG:lnd.landcode xsi:nil="true"/>
<BG:lnd.landnaam xsi:nil="true"/>
<BG:sub.adresBuitenland1 xsi:nil="true"/>
<BG:sub.adresBuitenland2 xsi:nil="true"/>
<BG:sub.adresBuitenland3 xsi:nil="true"/>
</BG:sub.verblijfBuitenland>
<BG:sub.correspondentieAdres>
<BG:typering xsi:nil="true"/>
<BG:wpl.woonplaatsNaam xsi:nil="true"/>
<BG:aoa.woonplaatsWaarinGelegen>
<BG:wpl.identificatie xsi:nil="true"/>
<BG:wpl.woonplaatsNaam xsi:nil="true"/>
</BG:aoa.woonplaatsWaarinGelegen>
<BG:postcode xsi:nil="true"/>
<BG:aoa.identificatie xsi:nil="true"/>
<BG:wpl.identificatie xsi:nil="true"/>
<BG:opr.identificatie xsi:nil="true"/>
<BG:gor.openbareRuimteNaam xsi:nil="true"/>
<BG:gor.straatnaam xsi:nil="true"/>
<BG:aoa.huisnummer xsi:nil="true"/>
<BG:aoa.huisletter xsi:nil="true"/>
<BG:aoa.huisnummertoevoeging xsi:nil="true"/>
<BG:sub.postadresType xsi:nil="true"/>
<BG:sub.postadresNummer xsi:nil="true"/>
</BG:sub.correspondentieAdres>
<BG:sub.telefoonnummer xsi:nil="true"/>
<BG:sub.faxnummer xsi:nil="true"/>
<BG:sub.emailadres xsi:nil="true"/>
<BG:sub.url xsi:nil="true"/>
<BG:sub.rekeningnummerBankGiro xsi:nil="true"/>
<BG:inp.burgerlijkeStaat xsi:nil="true"/>
<BG:inp.gemeenteVanInschrijving xsi:nil="true"/>
<BG:inp.datumInschrijving xsi:nil="true"/>
<BG:vbt.aanduidingVerblijfstitel xsi:nil="true"/>
<BG:inp.datumVestigingInNederland xsi:nil="true"/>
<BG:inp.immigratieLand xsi:nil="true"/>
<BG:inp.datumVertrekUitNederland xsi:nil="true"/>
<BG:inp.emigratieLand xsi:nil="true"/>
<BG:ing.indicatieGezagMinderjarige xsi:nil="true"/>
<BG:inp.indicatieGeheim xsi:nil="true"/>
<BG:ing.indicatieBlokkering xsi:nil="true"/>
<BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW">
<BG:gerelateerde StUF:entiteittype="NPS">
<BG:inp.bsn xsi:nil="true"/>
<BG:anp.identificatie xsi:nil="true"/>
<BG:sub.typering xsi:nil="true"/>
<BG:geslachtsnaam xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaam xsi:nil="true"/>
<BG:voorletters xsi:nil="true"/>
<BG:voornamen xsi:nil="true"/>
<BG:aanduidingNaamgebruik xsi:nil="true"/>
<BG:geslachtsnaamPartner xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true"/>
<BG:aanhefAanschrijving xsi:nil="true"/>
<BG:voornamenAanschrijving xsi:nil="true"/>
<BG:geslachtsnaamAanschrijving xsi:nil="true"/>
<BG:geslachtsaanduiding xsi:nil="true"/>
<BG:geboortedatum xsi:nil="true"/>
<BG:overlijdensdatum xsi:nil="true"/>
<BG:inp.burgerlijkeStaat xsi:nil="true"/>
<BG:ing.indicatieGezagMinderjarige xsi:nil="true"/>
<BG:inp.indicatieGeheim xsi:nil="true"/>
</BG:gerelateerde>
<BG:soortVerbintenis xsi:nil="true"/>
<BG:datumSluiting xsi:nil="true"/>
<BG:datumOntbinding xsi:nil="true"/>
</BG:inp.heeftAlsEchtgenootPartner>
<BG:inp.heeftAlsKinderen StUF:entiteittype="NPSNPSKND">
<BG:gerelateerde StUF:entiteittype="NPS">
<BG:inp.bsn xsi:nil="true"/>
<BG:anp.identificatie xsi:nil="true"/>
<BG:sub.typering xsi:nil="true"/>
<BG:geslachtsnaam xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaam xsi:nil="true"/>
<BG:voorletters xsi:nil="true"/>
<BG:voornamen xsi:nil="true"/>
<BG:aanduidingNaamgebruik xsi:nil="true"/>
<BG:geslachtsnaamPartner xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true"/>
<BG:aanhefAanschrijving xsi:nil="true"/>
<BG:voornamenAanschrijving xsi:nil="true"/>
<BG:geslachtsnaamAanschrijving xsi:nil="true"/>
<BG:geslachtsaanduiding xsi:nil="true"/>
<BG:geboortedatum xsi:nil="true"/>
<BG:overlijdensdatum xsi:nil="true"/>
<BG:inp.burgerlijkeStaat xsi:nil="true"/>
<BG:ing.indicatieGezagMinderjarige xsi:nil="true"/>
<BG:inp.indicatieGeheim xsi:nil="true"/>
</BG:gerelateerde>
</BG:inp.heeftAlsKinderen>
<BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
<BG:gerelateerde StUF:entiteittype="NPS">
<BG:inp.bsn xsi:nil="true"/>
<BG:anp.identificatie xsi:nil="true"/>
<BG:sub.typering xsi:nil="true"/>
<BG:geslachtsnaam xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaam xsi:nil="true"/>
<BG:voorletters xsi:nil="true"/>
<BG:voornamen xsi:nil="true"/>
<BG:aanduidingNaamgebruik xsi:nil="true"/>
<BG:geslachtsnaamPartner xsi:nil="true"/>
<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true"/>
<BG:aanhefAanschrijving xsi:nil="true"/>
<BG:voornamenAanschrijving xsi:nil="true"/>
<BG:geslachtsnaamAanschrijving xsi:nil="true"/>
<BG:geslachtsaanduiding xsi:nil="true"/>
<BG:geboortedatum xsi:nil="true"/>
<BG:overlijdensdatum xsi:nil="true"/>
<BG:inp.burgerlijkeStaat xsi:nil="true"/>
<BG:ing.indicatieGezagMinderjarige xsi:nil="true"/>
<BG:inp.indicatieGeheim xsi:nil="true"/>
</BG:gerelateerde>
</BG:inp.heeftAlsOuders>
</BG:object>
</BG:scope>
</BG:npsLv01>
</soapenv:Body></soapenv:Envelope>
